<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"881adc569d14a23b8338809d5d628e381a43aa0bbc880f3104d1ec2844a5aed7","plan_job_ref":"Job Plan Airflow DAGs #531 at https://github.com/cal-itp/data-infra/actions/runs/17330548117","plan_out_hash":"d843ca5224aebca2d99c5000b16e146d12872b6fd736de7172fe71ca9d4fac1e","plan_hash":"fb3799fbab20fb5a36fd6f17b71c0cf2eb2494b28b92f5ad739c012a7309089b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_payments_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "rGkeJQ==" -> (known after apply)
!~      detect_md5hash      = "7eXeFNXOFcei9euviktt+g==" -> "different hash"
!~      generation          = 1752703531739419 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_payments_dag.py"
!~      md5hash             = "7eXeFNXOFcei9euviktt+g==" -> (known after apply)
        name                = "dags/dbt_payments_dag.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #531](https://github.com/cal-itp/data-infra/actions/runs/17330548117)